Autodesk.Revit.DB.Mechanical.MEPSection.IsMain(Autodesk.Revit.DB.ElementId)
Check whether the type of fitting in this section is main.
fittingId:
The element id which can be duct fitting and pipe fitting.
Returns:
True if the type of fitting in this section is main
False if the type of fitting in this section is branch
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId fittingId does not correspond to a valid section fitting member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.GetSegmentLength(Autodesk.Revit.DB.ElementId)
Get the length for the specified segment id in this section.
segmentId:
The element id which can be duct segment and pipe segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId segmentId does not correspond to a valid section segment member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.GetCoefficient(Autodesk.Revit.DB.ElementId)
Gets the loss coefficient for the specified element id in this section.
Remarks:
For Duct, it is loss coefficient.
For Pipe, the loss coefficient is equivalent to the friction factor.
Loss coefficient is a number.
The unit type is UT_Number.
elemId:
The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elemId does not correspond to a valid section member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Mechanical.MEPSection.GetPressureDrop(Autodesk.Revit.DB.ElementId)
Gets the pressure drop for the specified element id in this section.
elemId:
The element id which can be duct segment, duct fitting , pipe segment and pipe fitting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId elemId does not correspond to a valid section member.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013